In [71]:
import pandas as pd

In [72]:
import numpy as np

In [73]:
import matplotlib.pyplot as plt

```
pip3 install matplotlib
```

In [74]:
import matplotlib.pyplot as plt

In [75]:
s = pd.Series([1,3,5,np.nan,6,8])

In [9]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20180101', periods=6)

In [11]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
               '2018-01-05', '2018-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, column=list('ABCD'))

TypeError: __init__() got an unexpected keyword argument 'column'

In [13]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [14]:
df

                   A         B         C         D
2018-01-01 -0.875169  0.773057 -1.509474  0.587373
2018-01-02  1.602814 -1.346107 -1.149605  1.741583
2018-01-03  0.977945 -3.200327  1.456634  0.627891
2018-01-04 -0.538477  2.171990 -0.456900 -0.370125
2018-01-05  0.633496  0.453940 -0.210321 -0.072306
2018-01-06  0.566910  1.048085 -0.274412  0.785539

In [15]:
df = pd.DataFrame(np.random.randn(6,4))

In [16]:
df

          0         1         2         3
0  0.991876 -1.768358 -0.895938  0.115129
1  1.444309 -0.613992 -1.182965 -0.431772
2  0.595356 -0.782992  0.199190  1.084111
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545
5  0.446462 -0.123229  0.889147 -0.534338

In [17]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20180102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'})

In [18]:
df2

     A          B    C  D      E    F
0  1.0 2018-01-02  1.0  3   test  foo
1  1.0 2018-01-02  1.0  3  train  foo
2  1.0 2018-01-02  1.0  3   test  foo
3  1.0 2018-01-02  1.0  3  train  foo

In [19]:
dates = pd.date_range('20180101', periods=4)

In [20]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20180102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo'}, index=dates)

In [21]:
df2

              A          B   C  D      E    F
2018-01-01  1.0 2018-01-02 NaN  3   test  foo
2018-01-02  1.0 2018-01-02 NaN  3  train  foo
2018-01-03  1.0 2018-01-02 NaN  3   test  foo
2018-01-04  1.0 2018-01-02 NaN  3  train  foo

In [22]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [23]:
df2.A

2018-01-01    1.0
2018-01-02    1.0
2018-01-03    1.0
2018-01-04    1.0
Freq: D, Name: A, dtype: float64

In [24]:
df2.abs

<bound method NDFrame.abs of               A          B   C  D      E    F
2018-01-01  1.0 2018-01-02 NaN  3   test  foo
2018-01-02  1.0 2018-01-02 NaN  3  train  foo
2018-01-03  1.0 2018-01-02 NaN  3   test  foo
2018-01-04  1.0 2018-01-02 NaN  3  train  foo>

In [25]:
df

          0         1         2         3
0  0.991876 -1.768358 -0.895938  0.115129
1  1.444309 -0.613992 -1.182965 -0.431772
2  0.595356 -0.782992  0.199190  1.084111
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545
5  0.446462 -0.123229  0.889147 -0.534338

In [26]:
df.head()

          0         1         2         3
0  0.991876 -1.768358 -0.895938  0.115129
1  1.444309 -0.613992 -1.182965 -0.431772
2  0.595356 -0.782992  0.199190  1.084111
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545

In [27]:
df.tail(3)

          0         1         2         3
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545
5  0.446462 -0.123229  0.889147 -0.534338

In [28]:
df

          0         1         2         3
0  0.991876 -1.768358 -0.895938  0.115129
1  1.444309 -0.613992 -1.182965 -0.431772
2  0.595356 -0.782992  0.199190  1.084111
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545
5  0.446462 -0.123229  0.889147 -0.534338

In [29]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [30]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [31]:
df.values

array([[ 0.99187585, -1.76835812, -0.89593773,  0.11512941],
       [ 1.44430853, -0.6139917 , -1.18296534, -0.43177217],
       [ 0.59535629, -0.7829921 ,  0.19918969,  1.08411052],
       [ 0.80824171, -0.66848655,  0.68836429, -1.20141149],
       [-1.74939985, -0.2851279 , -0.26250249, -1.6525449 ],
       [ 0.44646177, -0.12322882,  0.88914677, -0.53433799]])

In [32]:
df.describe()

              0         1         2         3
count  6.000000  6.000000  6.000000  6.000000
mean   0.422807 -0.707031 -0.094117 -0.436804
std    1.119346  0.576395  0.839282  0.968504
min   -1.749400 -1.768358 -1.182965 -1.652545
25%    0.483685 -0.754366 -0.737579 -1.034643
50%    0.701799 -0.641239 -0.031656 -0.483055
75%    0.945967 -0.367344  0.566071 -0.021596
max    1.444309 -0.123229  0.889147  1.084111

In [33]:
df.describe()

              0         1         2         3
count  6.000000  6.000000  6.000000  6.000000
mean   0.422807 -0.707031 -0.094117 -0.436804
std    1.119346  0.576395  0.839282  0.968504
min   -1.749400 -1.768358 -1.182965 -1.652545
25%    0.483685 -0.754366 -0.737579 -1.034643
50%    0.701799 -0.641239 -0.031656 -0.483055
75%    0.945967 -0.367344  0.566071 -0.021596
max    1.444309 -0.123229  0.889147  1.084111

In [34]:
df.T

          0         1         2         3         4         5
0  0.991876  1.444309  0.595356  0.808242 -1.749400  0.446462
1 -1.768358 -0.613992 -0.782992 -0.668487 -0.285128 -0.123229
2 -0.895938 -1.182965  0.199190  0.688364 -0.262502  0.889147
3  0.115129 -0.431772  1.084111 -1.201411 -1.652545 -0.534338

In [35]:
df.sort_index(axis=1,ascending=False)

          3         2         1         0
0  0.115129 -0.895938 -1.768358  0.991876
1 -0.431772 -1.182965 -0.613992  1.444309
2  1.084111  0.199190 -0.782992  0.595356
3 -1.201411  0.688364 -0.668487  0.808242
4 -1.652545 -0.262502 -0.285128 -1.749400
5 -0.534338  0.889147 -0.123229  0.446462

In [36]:
df

          0         1         2         3
0  0.991876 -1.768358 -0.895938  0.115129
1  1.444309 -0.613992 -1.182965 -0.431772
2  0.595356 -0.782992  0.199190  1.084111
3  0.808242 -0.668487  0.688364 -1.201411
4 -1.749400 -0.285128 -0.262502 -1.652545
5  0.446462 -0.123229  0.889147 -0.534338

In [37]:
dates = pd.date_range('20180101', periods=6)

In [38]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [39]:
df

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-03 -0.740987  0.003277  1.105983 -1.320511
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-05 -0.462452  0.063994  3.138448 -0.338391
2018-01-06  0.471300  1.187715 -0.371074  1.428672

In [40]:
df.sort_values(by='B')

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-03 -0.740987  0.003277  1.105983 -1.320511
2018-01-05 -0.462452  0.063994  3.138448 -0.338391
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-06  0.471300  1.187715 -0.371074  1.428672

In [41]:
df.sort_values(by='B',ascending=False)

                   A         B         C         D
2018-01-06  0.471300  1.187715 -0.371074  1.428672
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-05 -0.462452  0.063994  3.138448 -0.338391
2018-01-03 -0.740987  0.003277  1.105983 -1.320511
2018-01-01  0.048320 -0.131600 -0.617979  0.713764

In [42]:
df['A']

2018-01-01    0.048320
2018-01-02    0.486905
2018-01-03   -0.740987
2018-01-04    0.421583
2018-01-05   -0.462452
2018-01-06    0.471300
Freq: D, Name: A, dtype: float64

In [43]:
df[0:3]

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-03 -0.740987  0.003277  1.105983 -1.320511

In [44]:
df.loc[dates[0]]

A    0.048320
B   -0.131600
C   -0.617979
D    0.713764
Name: 2018-01-01 00:00:00, dtype: float64

In [45]:
df.loc[dates[1]]

A    0.486905
B    0.573071
C    0.942985
D   -1.755559
Name: 2018-01-02 00:00:00, dtype: float64

In [46]:
df[0:1]

                  A       B         C         D
2018-01-01  0.04832 -0.1316 -0.617979  0.713764

In [47]:
df[0:0]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [48]:
df[1:1]

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [49]:
df[0:2]

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-02  0.486905  0.573071  0.942985 -1.755559

In [50]:
df["A"]

2018-01-01    0.048320
2018-01-02    0.486905
2018-01-03   -0.740987
2018-01-04    0.421583
2018-01-05   -0.462452
2018-01-06    0.471300
Freq: D, Name: A, dtype: float64

In [51]:
df[["A","B"]]

                   A         B
2018-01-01  0.048320 -0.131600
2018-01-02  0.486905  0.573071
2018-01-03 -0.740987  0.003277
2018-01-04  0.421583  0.532819
2018-01-05 -0.462452  0.063994
2018-01-06  0.471300  1.187715

In [52]:
df.loc[dates[0]:dates[3],['A','B','D']]

                   A         B         D
2018-01-01  0.048320 -0.131600  0.713764
2018-01-02  0.486905  0.573071 -1.755559
2018-01-03 -0.740987  0.003277 -1.320511
2018-01-04  0.421583  0.532819  0.724137

In [53]:
df.loc[dates[0],'A']

0.04831975781129147

In [54]:
df.iloc[3]

A    0.421583
B    0.532819
C    0.301992
D    0.724137
Name: 2018-01-04 00:00:00, dtype: float64

In [55]:
df.loc[dates[3]]

A    0.421583
B    0.532819
C    0.301992
D    0.724137
Name: 2018-01-04 00:00:00, dtype: float64

In [57]:
df.loc['2018-01-03']

A   -0.740987
B    0.003277
C    1.105983
D   -1.320511
Name: 2018-01-03 00:00:00, dtype: float64

In [58]:
df

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-03 -0.740987  0.003277  1.105983 -1.320511
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-05 -0.462452  0.063994  3.138448 -0.338391
2018-01-06  0.471300  1.187715 -0.371074  1.428672

In [59]:
df.iat[1,1]

0.5730709718689353

In [60]:
df[df.A > 0]

                   A         B         C         D
2018-01-01  0.048320 -0.131600 -0.617979  0.713764
2018-01-02  0.486905  0.573071  0.942985 -1.755559
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-06  0.471300  1.187715 -0.371074  1.428672

In [61]:
df[df > 0]

                   A         B         C         D
2018-01-01  0.048320       NaN       NaN  0.713764
2018-01-02  0.486905  0.573071  0.942985       NaN
2018-01-03       NaN  0.003277  1.105983       NaN
2018-01-04  0.421583  0.532819  0.301992  0.724137
2018-01-05       NaN  0.063994  3.138448       NaN
2018-01-06  0.471300  1.187715       NaN  1.428672

In [62]:
df2 = df.copy()

In [63]:
df2['E'] = ['one', 'one', 'tow', 'three', 'four', 'three']

In [64]:
df2

                   A         B         C         D      E
2018-01-01  0.048320 -0.131600 -0.617979  0.713764    one
2018-01-02  0.486905  0.573071  0.942985 -1.755559    one
2018-01-03 -0.740987  0.003277  1.105983 -1.320511    tow
2018-01-04  0.421583  0.532819  0.301992  0.724137  three
2018-01-05 -0.462452  0.063994  3.138448 -0.338391   four
2018-01-06  0.471300  1.187715 -0.371074  1.428672  three

In [65]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2018-01-05 -0.462452  0.063994  3.138448 -0.338391  four

In [66]:
s1 = pd.Series([1,2,3,4,5,6],index=pd.date_range('20180102', periods=6))

In [67]:
s1

2018-01-02    1
2018-01-03    2
2018-01-04    3
2018-01-05    4
2018-01-06    5
2018-01-07    6
Freq: D, dtype: int64

In [68]:
df['F'] = s1

In [69]:
df

                   A         B         C         D    F
2018-01-01  0.048320 -0.131600 -0.617979  0.713764  NaN
2018-01-02  0.486905  0.573071  0.942985 -1.755559  1.0
2018-01-03 -0.740987  0.003277  1.105983 -1.320511  2.0
2018-01-04  0.421583  0.532819  0.301992  0.724137  3.0
2018-01-05 -0.462452  0.063994  3.138448 -0.338391  4.0
2018-01-06  0.471300  1.187715 -0.371074  1.428672  5.0

In [2]:
a=1

In [3]:
a

1